In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi = {"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,38,39]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     38
2       NaN    25.0     39

In [4]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [5]:
havaDurumuDataFrame.dropna(axis = 1 )

   Izmir
0     40
1     38
2     39

In [6]:
yeniVeri = {"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,38,39], "Antalya": [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [7]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     38      NaN
2       NaN    25.0     39      NaN

In [8]:
yeniDataFrame.dropna( axis = 1, thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     38
2       NaN    25.0     39

In [9]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     38      NaN
2       NaN    25.0     39      NaN

In [10]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     38     20.0
2      20.0    25.0     39     20.0

## groupby

In [16]:
maasSozlugu = {"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Calisan Ismi" : ["Kübra","Fatma","Ahmet","Atil","Eslina","Furkan"],
              "Maas" : [100,150,200,300,400,500]
              }

In [17]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [18]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazılım        Kübra   100
1    Yazılım        Fatma   150
2  Pazarlama        Ahmet   200
3  Pazarlama         Atil   300
4      Hukuk       Eslina   400
5      Hukuk       Furkan   500

In [25]:
grupObjesi = maasDataFrame.groupby("Departman")

In [ ]:
grupObjesi.count()

In [30]:
grupObjesi.min()

          Calisan Ismi  Maas
Departman
Hukuk           Eslina   400
Pazarlama        Ahmet   200
Yazılım          Fatma   100

In [31]:
grupObjesi.max()

          Calisan Ismi  Maas
Departman
Hukuk           Furkan   500
Pazarlama         Atil   300
Yazılım          Kübra   150

In [33]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0